{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "1", "default_text": "retrieval system improving effectiveness", "description": "What papers focus on improving the effectiveness of a retrieval system?", "narrative": "Relevant papers include research on what makes a retrieval system effective and what improves the effectiveness of a retrieval system. Papers that focus on improving something else or improving the effectiveness of a system that is not a retrieval system are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "2", "default_text": "machine learning language identification", "description": "What papers are about machine learning for language identification?", "narrative": "Relevant papers include research on methods of machine learning for language identification or how to improve those methods. Papers that focus on other methods for language identification or the usaged of machine learning not for language identification are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "3", "default_text": "social media detect self-harm", "description": "Which papers focus on how to recognize signs of self-harm in people's social media posts?", "narrative": "Relevant papers include research on early detection of self-harm on social media platforms such as Facebook, Instagram, Reddit, Twitter and co. Papers that addresses mental health issues like depression or anorexia are not relevant. Furthermore, papers that deal with self-harm but are not related to social media are also not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "4", "default_text": "stemming for arabic languages", "description": "Which papers focus on improving stemming in arabic languages?", "narrative": "Relevant papers include research on stemming methods for arabic languages or how to improve those methods. Papers that focus on stemming in other languages are not relevant, as well as papers that do not focus on stemming."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "5", "default_text": "audio based animal recognition", "description": "Which papers focus on classifying animal species by sound?", "narrative": "Relevant papers focus on recognizing the species of animals or sub-classes of animals via their sound profile. Papers that focus on other audio recognition fields such as music are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "6", "default_text": "Comparison different retrieval models", "description": "Which different retrieval models exist and what are their similarities and differences?", "narrative": "Relevant documents include the description and comparison of at least two different retrieval models. Documents containing only information about one specific retrieval model are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "7", "default_text": "Cache architecture", "description": "How are caches composed and how does their architecture function?", "narrative": "Relevant documents include the description of the structure of a cache. Documents that only provide general information about caches and their function are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "8", "default_text": "Document scoping formula", "description": "How was the formula for document scoping developed?", "narrative": "Relevant documents include information about how the formula for document scoping was derived from it's variables. Documents only using the formula are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "9", "default_text": "Pseudo-relevance feedback", "description": "How does pseudo-relevance feedback improve a query?", "narrative": "Documents that specifically showcase how this method is used to improve the query are relevant. Documents which prove the effectiveness of the method are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "10", "default_text": "How to represent natural conversations in word nets", "description": "How is it possible to filter and classify information that can be found in chats and interviews?", "narrative": "Relevant documents include information about effective complexity reduction of natural conversations and how to put the extracted content in an order. Not relevant documents are those who speak about data bases and artifically obtained data."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "11", "default_text": "Algorithm acceleration with Nvidia CUDA", "description": "Developing new algorithms and improving the existing ones leveraging a graphics processing unit with CUDA", "narrative": "Relevant entries only include information about the Nvidia CUDA computing platform. Entries not mentioning CUDA as the main tool are irrelevant. Entries about other computing platforms, such as AMD ROCm are irrelevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "12", "default_text": "mention of algorithm", "description": "What entries mention algorithms in their abstract?", "narrative": "Relevant entries mention algorithms as part of their work. Entries containing one or more algorithms are both relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "13", "default_text": "at least three authors", "description": "Which entries have at least three authors?", "narrative": "Relevant entries have at least three authors. Entries containing only one or two authors are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "14", "default_text": "German domain", "description": "Which entries include German domains?", "narrative": "Relevant entries include links with a German domain. Entries ending with .de are relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "15", "default_text": " mention of open source ", "description": " Which entries mention open source software/projects ", "narrative": "Relevant entries mention open source projects or software. Entries containing the phrase \"open source\" are relevant. "}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "16", "default_text": "Inclusion of text-mining", "description": "Which entries mention text-mining?", "narrative": "Relevant entries mention text-mining as one of their methods. Entries including text-mining, e. g. in their abstract or keywords."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "17", "default_text": "The Ethics of Artificial Intelligence", "description": "What are the ethical considerations surrounding the development and use of artificial intelligence?", "narrative": "Relevant entries should explore the ethical issues related to artificial intelligence, including accountability and responsibility, privacy and surveillance, job displacement, and the potential for AI to be used for harm."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "19", "default_text": "machine learning for more relevant results", "description": "Which papers describe methods to find more relevant results using machine learning?", "narrative": "Relevant papers describe one or more methods to find more relevant results using machine learning. Papers about just machine learning in IR in general or papers just about finding more relevant results are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "20", "default_text": "Crawling websites using machine learning", "description": "Papers that describe how to use AI to crawl the context of websites more efficient.", "narrative": "Papers in this topic describe methods and algorithms to use machine learning for crawling. They also contain information on the latest research findings on the topic. Papers about crawling methods without AI are not relevant for this topic."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "21", "default_text": "Recommenders influence on users", "description": "Papers that describe the change in user behaviour because of recommenders?", "narrative": "Relevant papers describe how users are affected by recommenders, papers about the recommenders from a technological point of view are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "22", "default_text": "Search engine caching effects", "description": "Papers that describe the effects and/or efficient use of search engine caching in terms of result freshness, query latency and other potential advantages or disadvantages ", "narrative": "Papers in this topic will describe the design trade-off between low latency querying and returning the most recently available results as well as different architectures to create efficient caching systems. Results should not contain any other caching related topics (e.g. hardware or web browsers)"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "23", "default_text": "Consumer Product reviews", "description": "Papers that describe the effects of product reviews on consumer decisions", "narrative": "Relevant papers would describe the influence that reviews have on individual decisions of the consumer on whether to buy a product or not. Not relevant papers, would contain other studies about reviews, that are not pertaining to human psychology"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "24", "default_text": "Limitations machine learning", "description": "Which papers describe the limitations of machine learning?", "narrative": "Relevant papers describe the limitations of machine learning ( e.g. dependence on data quality and quantity, limited ability to handle complex tasks, vulnerability to disturbances and attacks, need for resources and energy). Papers that contains machine learning but not its limitations are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "25", "default_text": "medicine related research", "description": "Papers that did research on medical data", "narrative": "Find papers that did their research on medical data"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "26", "default_text": "Natural Language Processing", "description": "Find papers that include the term natural language processing", "narrative": ""}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "27", "default_text": "graph based ranking", "description": "Papers that are written about the method of graph based ranking", "narrative": "Find papers that are about graph based ranking. Other papers are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "28", "default_text": "medical studies that use information retrieval ?", "description": "What documents show information retrieval techniques used in medical studies ?", "narrative": "Relevant documents show information retrieval used in medical studies. Documents that do not look at medical studies and information retrieval are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "29", "default_text": "information retrieval on different language sources ?", "description": "What articles identify the impact of sources in different languages on information retrieval tasks ?", "narrative": "Relevant documents must concern more than one language. Documents have to identify the impact of the languages. Documents that only reference a single language or don't reference the impact of them are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "30", "default_text": "papers that compare multiple information retrieval methods", "description": "Which documents compare multiple information retrieval methods?", "narrative": "Relevant documents must contain comparisons between multiple information retrieval methods. Documents that only discuss one method are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "31", "default_text": " risks of information retrieval in social media ?", "description": " What are the risks associated with using information retrieval in social media?", "narrative": "Relevant documents must discuss the risks of using information retrieval in social media. Documents that only focus on general risks of social media or don't specifically address information retrieval are not relevant. Examples of relevant topics might include privacy concerns, potential for misinformation or manipulation, or the impact on mental health."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "32", "default_text": "actual experiments that strengthen theoretical knowledge", "description": "Which documents include actual experiments that strengthen theoretical knowledge about information retrieval? ", "narrative": "Relevant documents muss contain true experiments. Documents that do not include any experiments and only provide knowledge about information retrieval are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "33", "default_text": "fake news detection", "description": "All publications and workshops concerning the detection (identification) of fake news (disinformation, misinformation or deep fakes)", "narrative": "Relevant documents show the bigram of \"fake news\" or its synonyms in the context of their detection mechanisms."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "34", "default_text": " multimedia retrieval ", "description": " Which documents have information about multimedia information retrieval. ", "narrative": " To be relevant documents have to have methods and information of multimedia retrieval."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "35", "default_text": "processing natural language for information retrieval", "description": "Which documents contain informtion like problem definitions, methods, algorithms or challenges in processing natural language for information retrieval systems?", "narrative": "Relevant documents provide information about processing natural language associated with information retrieval. Documents containing information about information retrieval not associated with natural language or the other way round are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "36", "default_text": "recommendation systems", "description": "What documents contain information on recommendation systems (systems that suggest items to users based on their past behaviour and interests)", "narrative": "Relevant documents contain information or research on the topic of recommendation systems in the context of information retrieval."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "37", "default_text": "personalised search in e-commerce", "description": "Which papers include research on sentiment analysis in informational retrieval?", "narrative": "Papers that refer to the development and implementation of algorithms and techniques that use individual user data to provide personalised product recommendations and search results within an e-commerce context are relevant. This includes the collection and \tanalysis of user data such as browsing history, search queries, and purchase history, as well as the use of machine learning techniques to build user \tmodels and provide personalised recommendations.In general, topics that are not directly related to the development, implementation, or evaluation of personalised search algorithms in e-commerce may not be relevant to this topic."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "38", "default_text": "sentiment analysis", "description": "  Which papers include research on sentiment analysis in informational retrieval ", "narrative": " Relevant papers discuss techniques of sentiment analysis (e.g. multi-model sentiment analysis using neural networks). Not relevant are papers on analysis that involving sentiment analysis. Not relevant are papers on analysis of factual statements."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "39", "default_text": "informational retrieval using neural networks", "description": "  Which papers include research on using neural networks in informational retrieval ", "narrative": " Relevant papers discuss using neural networks to improve the effectiveness of information retrieval systems (e.g. natural language processing, deep learning and other machine learning approaches). Not relevant are papers on other types of machine learning or artificial intelligence that are to specifically designed for information retrieval (e.g. reinforcement learning or computer vision)."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "40", "default_text": "Query log analysis", "description": "Which papers include research on query log analysis in informational retrieval?", "narrative": "Papers that involves the analysis of logs of user search queries, as well as their corresponding search results and user interactions with those results are relevant. This includes insights into user behavior, search patterns and the use of this information to improve search engine performance and user experience.In general, topics that are not directly related to the study of user search behavior and search patterns, with the goal of improving search engine performance and user experience such as the study of search algorithms or system architecture and the technical details of search engine implementation are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "41", "default_text": "entity recognition", "description": "Retrieval of documents related to entity recognition.", "narrative": "Relevant documents should highlight entity recognition and its methods and applications. Documents that do not mention entity recognition are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "42", "default_text": "relevance assessments", "description": "Retrieval of documents related to relevance assessments.", "narrative": "Relevant documents should highlight relevance assessments and its methods and applications. Documents that do not mention relevance assessments are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "43", "default_text": "Deep Neural Networks", "description": "Which papers talk about Deep Neural Networks?", "narrative": "Relevant papers have at least one mention of Deep Neural. Paper containing only Deep or Neural are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "44", "default_text": "Information Retrieval", "description": "Which papers talk about Information Retrieval?", "narrative": "Relevant paper have at least one mention of Information Retrieval. Paper containing only Information or Retrieval are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "45", "default_text": "Analysis for Android apps", "description": "Which papers talk about the analysis of android apps?", "narrative": "Relevant papers talk at least in one line about android apps. Paper containing only apps are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "46", "default_text": "The University of Amsterdam", "description": "Which papers are created by the University of Amsterdam?", "narrative": "Relevant papers are created or at least co-written by the University of Amsterdam. Paper containing only\n      University not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "47", "default_text": "Neural Ranking for eCommerce Product Search", "description": "Which paper is about Ranking Product Search and its applications in eCommerce?", "narrative": "Relevant papers that addresses application of Task Models and Textual Embeddings in the field of electronic\n      commerce. Not relevant are papers showcasing applications that do not contain the topic eCommerce."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "48", "default_text": "web pages evolution", "description": "Which paper is about the evolution of web pages?", "narrative": "Relevant paper have at least one mention of web evolution. Paper containing only web page or evolution are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "49", "default_text": " exhaustivity of index ", "description": "Documents that include explanations for what exhaustivity means for an index. ", "narrative": "Relevant documents include the words index and/or indexing and exhaustivity in combination. Documents only containing indexing and/or index or only containing exhaustivity are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "50", "default_text": "query optimization", "description": "How can I optimize my queries and what are the main algorithms for them?", "narrative": "Relevant optimizations for queries and their respective algorithms in the information retrieval field. Documents not concerning the algorithmic approach behind queries are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "51", "default_text": " Cosine similarity vector ", "description": " How do I convert documents and queries into vectors for the cosine similarity? ", "narrative": " Relevant documents have the process of building the high-dimensional space out of documents and queries. The calculation of the angles via the cosine are not relevant. "}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "52", "default_text": " reverse indexing", "description": " What sources explain reverse indexing? ", "narrative": " Relevant sources that focus on reverse indexing. Sources that mention reverse indexing but does not explain reverse indexing are not relevant. "}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "53", "default_text": "index compression techniques", "description": "Which papers (abstracts) have information on techniques for index compression?", "narrative": "Relevant abstracts discuss index compression techniques. Abstracts that mention indexing but do not provide information about compression methods are not relevant. "}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "54", "default_text": "search engine optimization with query logs", "description": "What documents explain the optimization of a search engine that utilize query logs to do so?", "narrative": "Relevant documents include those referring to optimization and query logs. Those that only center one of these topics are not relevant. Any area of search engine optimization is relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "55", "default_text": "BM25", "description": "How does BM25 work?", "narrative": "Since BM25 is a very popular algorithm and I only used idf, I want to know the specific differences between the two."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "56", "default_text": " What makes Natural Language Processing natural? ", "description": "What is Natural Language Processing and why is it called natural?", "narrative": "Natural Language Processing is a model to process data regarding human language. It's called natural because you are not restricted to rules how the data produced by humans should look like."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "57", "default_text": "principle of a information retrieval indexing", "description": "How does indexing work in information retrieval?", "narrative": "Is the process of identifying and describing documents. These should then be classified for later analysis."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "58", "default_text": "Architecture of web search engine", "description": "How are web search engines composed and how does their architecture function?", "narrative": "Relevant documents include the description of the structure of a web search engine. Documents containing generel information about search engines or their history are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "59", "default_text": "What is AHP", "description": "What does the abbreviation AHP mean?", "narrative": "Relevant documents include what AHP is spelled out and what its definition is. Documents containing detailed usecases of AHP or abbreviiations of AHP outside of computer sience are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "60", "default_text": "What is information retrieval?", "description": "What topics are included in information retrieval and what is the goal of it? ", "narrative": "Relevant documents include a definition of information retrieval and a brief summory of the topics it covers. Documents containing in depth analysis of information retrieval algorithms are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "61", "default_text": "Efficient retrieval algorithms", "description": "Which retrieval algorithms work the fastest?", "narrative": "Relevant documents contain (pseudo) code examples and research of the time complexity for those algorithms. Not relevant are documents that contain a list of all possible retrieval algorithms."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "62", "default_text": "How to avoid spam results", "description": "Which techniques exist to deal with well-directed result manipulation and spam?", "narrative": "Relevant documents describe techniques to deal with manipulation or spam. Not relevant are documents, that just explain what result manipulation or spam is."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "63", "default_text": "Information Retrieval with algorithms", "description": "Using algorithms for effective Information Retrieval", "narrative": "Retrieve documents relevant to the query terms \"information retrieval\" and \"algorithms\""}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "64", "default_text": "misspellings in queries", "description": "Which documents cover query spelling autocorrection?", "narrative": "Relevant Information Retrieval documents cover the topic of misspellings in search engine queries and how to automatically correct them. Documents containing only the words \"queries\" or \"in\" are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "65", "default_text": "information in different language", "description": "Which papers cover Cross-language information retrieval", "narrative": "Relevant papers cover concepts, that fall under the category CLIR. Papers on language or information on their own or in another context are not relevant."}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "66", "default_text": "Abbreviations in queries", "description": "Which papers cover the handling of abbreviations in queries?", "narrative": "Relevant papers cover concepts, that deal with the occurrence of abbreviations in queries. Papers on abbreviations in general or on how to deal with abbreviations in documents are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "67", "default_text": "lemmatization algorithms", "description": "Which papers cover lemmatization algorithms?", "narrative": "Relevant IR documents cover the topic of lemmatization algorithms. Papers on the basic funktion of lemmatization algorithms and their integration into search engines"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "68", "default_text": "filter ad rich documents", "description": "None", "narrative": "How to filter webpages that have tons of ads and pop ups out of ir search with maintaining low search time"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-20240504-training", "qid": "18", "default_text": "Advancements in Information Retrieval", "description": "None", "narrative": "Relevant texts contain Innovations or Advancements in Information Retrieval in recent years (e.g. after 2010)"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "1", "default_text": "accuracy of symptom searching on online platforms", "description": "which studies focus on symptom searching behavior on online platforms researched by patients", "narrative": "relevant studies include research that examines the precision and reliability of symptom searching conducted by patients online e g via google papers discussing the risks of symptom searching behavior particularly focusing on the reliability of information and advise then given to the patient on the internet are preferred"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "5", "default_text": "wildcard operators", "description": "why do we use wildcard operators", "narrative": "to better find a term one is looking for it is helpful to use wildcard operators properly to use them for a word one can use and the is not used commonly however and such it is easiest to stick to use wildcard operators with the and the when using wildcard operators for a word one can use fixed and variable wildcard operators fixed wildcard operators is when one letter of a term is exchangedwith a for example auto becomes to autos but not autositz with variable wildcard operators such as auto it may become autos as well as autositz as can stand for multiple letters while is only a placeholder for one letter additionally one can differate between right left and middle or internal wildcard operators right wildcard operators means that the term is using them at its end left wildcard operators describes the term using wildcard operators at its start and internal truncation means that the word is using wildcard operators in the middle with the letters at its ends staying untouched if one is looking for the name of an author for example one could use wildcard operators as such me er all in all wildcard operators are a researching tool that expands the pool of relevant results as well as the number of search results in total this may also lead to a higher number of non relevant results coming up as search results"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "10", "default_text": "machine learning techniques in information retrieval", "description": "how are machine learning techniques applied in information retrieval systems and what is their impact", "narrative": "relevant documents should discuss how machine learning techniques are used to enhance information retrieval covering aspects such as ranking algorithms relevance feedback personalization and recommendation systems"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "13", "default_text": "pro and contra of boolean queries", "description": "what are positive and negative aspects of boolean queries and what are alternatives", "narrative": "relevant documents should contain positive and or negative aspects of the use of boolean queries as well as how they are used why they are used why not and what alternatives there are"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "14", "default_text": "soundex", "description": "find documents which deal with phonetic correction", "narrative": "relevant documents describing soundex or phonetic correction an alternative indexing procedure which is based on pronounciation"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "15", "default_text": "advantages of boolean retrieval", "description": "what are the advantages of boolean retrieval", "narrative": "relevant documents examine the benefits of boolean retrieval in practice"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "16", "default_text": "the use of boolean retrieval in library catalogues", "description": "find documents which describe how libarians explain to users how boolean retrieval works how it can be integrated in library catalogues and how often people use this search method", "narrative": "relevant documents explain how boolean retrieval works how it can be integrated in library catalogues and how often the users use this search method"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "19", "default_text": "boolean retrieval effectiveness", "description": "find documents that explain when the use of boolean retrieval is most effective", "narrative": "relevant documents show how to utilize boolean retrieval to get the best search results relevant documents might also list different boolean systems or models and compare them"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "21", "default_text": "boolean operators", "description": "what are the boolean operators and how do they work", "narrative": "the boolean operators are the words and or and not they work as follows and means that both words have to exist together for the document to be found just one of the words will not suffice for the operator and to work it will however work or the operator or if the operator or is used the docguments needs at least one of the words coupled togetehr by the operator to be found therefore the results for the search church or devil will show documents that have the words church and devil in them as well as documents with just the word church or just the word devil the not operator minimalises the search results by excludng a term church not devil will only show search results with the word church in them and not show any that include the term devil no matter wether the word church is also found within the document or not if the term devil is in the document it is filtered out the boolean operators therefor work as filters making sure terms are in and excluded as preferred"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "24", "default_text": "digital technologies in libraries", "description": "how important are digital technologies in libraries", "narrative": "the implementation of these digital technologies in libraries aims to improve access to information increase the efficiency of services and optimize the user experience"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "26", "default_text": "zipf s law in information science", "description": "find documents that discuss zipf s law in the context of information science", "narrative": "relevant documents analyze the application of zipf s law to word frequencies in texts and the significance of this law for the development of indexing methods and information retrieval systems they should also cover the theoretical foundations of zipf s law as well as empirical studies and applications in information science"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "27", "default_text": "boolean retrieval and information retrieval", "description": "how does boolean retrieval work in information retrieval systems", "narrative": "relevant documents should discuss how boolean retrieval techniques are used for information retrieval explaining the use of and or not"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "29", "default_text": "limits of modern libraries", "description": "how far can a library be redesigned and changend until it can no longer be called a library", "narrative": "relevant documents should show what the ethical and societal views on libraries are that libraries are in a state of flux and that their transformation will bring changes and risks that third places and the idea of a cultural and exchange centre have become more relevant pushing the old image of a library into the background and the past which changes would be so dramatic that an innovation would go too far and split the original concept of a library whereby these facilities can no longer be called a library with a clear conscience but instead become a fusion hybrid of various offers"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "30", "default_text": "the use of boolean operators in library systems", "description": "find documents that address the reasons for using boolean operators in library systems", "narrative": "relevant documents analyze the advantages of boolean operators in library systems and thus show why they are used in this context"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "32", "default_text": "evaluation of the ranking in search results", "description": "what evaluation criteria are there to assess the ranking of results in search engines", "narrative": "relevant documents show various criteria and options for evaluating the ranking of results in various search engines according to relevance and quality"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "33", "default_text": "information retrieval jobs", "description": "find documents which are about jobs in which information retrieval is relevant", "narrative": "relevant documents describe those professional fields and industries which primarily focus on information retrieval and those in which information retrieval is needed as an action step in their workflow"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "37", "default_text": "boolean algebra", "description": "what is boolean algebra", "narrative": "boolean algebra is a branch of algebra used with logic the values of variables aren t numeric they consist in true denoted as 1 or false denoted as 0 in information retrieval they are used as found and not found if the term you search is in written in the document it is found so you put a 1 another topic in boolean algebra are the boolean operators and not and or they are used to manipulate the truth values and is the operator of conjuction denoted as it is used to combine two or more expressions or terms yielding true only if all the expressions are found and true the operator not is the negation and denoted as it negates the value of truth of an expression or more of them the last operator is or the disjunction it s denoted as v it combines 2 or more exprssions yielding true if one or more expressions are true at least one must be found"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "38", "default_text": "relevance criteria criteria for relevant search results", "description": "find documents that describe criteria for the relevance of search results", "narrative": "relevant documents analyze which criteria are underlying so that searchers can consider the results relevant to their search queries"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "39", "default_text": "zipf s law", "description": "find documents dealing with the statistical distribution of words by zipf s law", "narrative": "relevant documents analyze the mathematical representation of text analysis after zipf s law"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "40", "default_text": "boolean retrieval model", "description": "find documents that address the boolean retrieval model", "narrative": "relevant documents analyze the boolean operators and their operation in search queries"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "41", "default_text": "indexing in information retrieval systems", "description": "what are the various indexing techniques used in information retrieval systems and how do they impact retrieval efficiency and effectiveness", "narrative": "relevant documents should discuss different indexing techniques such as inverted indexing signature files and clustering based indexing they should cover how these techniques work their advantages and disadvantages and their impact on the efficiency and effectiveness of information retrieval systems discussions may include algorithmic details performance comparisons and practical implementations in real world systems"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "43", "default_text": "problems of retrieval systems", "description": "find documents that address the problems of retrieval systems", "narrative": "relevant documents analyze and characterize the problems and limitations of retrieval systems"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "44", "default_text": "online quizzes", "description": "find documents that deal with the topic of online quizzes", "narrative": "relevant documents describe the structure and procedure of online quizzes and also provide examples of the topic the examples can also be placed within an overall context in order to create a more accurate picture for online quizzes"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "49", "default_text": "evaluation", "description": "find documents which explain evaluation", "narrative": "relevant documents contain definitions of evaluation in the context of information retrieval understandable for beginners"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "50", "default_text": "machine learning in information retrieval", "description": "find documents that discuss how machine learning techniques are used to improve information retrieval systems", "narrative": "relevant documents should focus on how machine learning techniques are applied to various aspects of information retrieval systems to enhance their performance and accuracy this includes the use of machine learning for query understanding document indexing relevance ranking and retrieval effectiveness documents should also explore how machine learning models can learn from user interactions to improve search results over time personalize search experiences and handle large scale data case studies practical implementations and evaluations of machine learning integration in commercial and academic ir systems are also relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "51", "default_text": "artificial intelligence in medical diagnostics", "description": "find documents that discuss the application of ai technologies in medical diagnostics", "narrative": "relevant documents analyze the use of artificial intelligence to improve disease diagnosis they should cover the various algorithms and techniques used in medical imaging and data analysis as well as the outcomes and benefits achieved through these technologies"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "53", "default_text": "zipf s law and information retrieval", "description": "find documents that describe zipf s law in the context of information retrieval", "narrative": "relevant documents explain zipf s law and how it is applied in information retrieval including examples and case studies"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "55", "default_text": "boolean queries", "description": "find documents discussing the basics about boolean queries in information retrieval systems", "narrative": "the documents should cover the basics of boolean queries including operators and or not which is important so one is able to write search queries"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "56", "default_text": "fishing in germany", "description": "find documents that include the topic fishing with the country germany", "narrative": "analyze all documents that discuss fishing practices popular fishing spots fishing regulations and the types of fish found in germany relevant documents should cover any aspect of fishing within germany including but not limited to recreational fishing commercial fishing environmental impacts and conservation efforts related to fishing articles reports and guides about fishing events or competitions in germany would also be of interest"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "57", "default_text": "the history and development of information retrieval", "description": "find documents that discuss the evolution and milestones in the field of information retrieval", "narrative": "relevant documents analyze the historical progress significant milestones and key developments in the technology and methodologies of information retrieval highlighting the transition from early systems to modern approaches"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "58", "default_text": "zipf s law", "description": "in the context of information retrieval zipf s law helps improve indexing efficiency document relevance assessment handling of stop words data compression and accuracy of search results by showing that a small number of words occur very frequently while many words are rare", "narrative": "in the field of information retrieval zipf s law has significant implications it enhances indexing efficiency meaning that ir systems can efficiently index and process common words saving storage space and increasing search speed however the law also aids in document relevance assessment by considering rare words as more informative than common ones this is utilized in algorithms like tf idf to evaluate a word s frequency relative to the entire corpus additionally the law supports data compression where frequent words can be compressed with shorter codes reducing the overall size of indexed data zipf s law can also work with stop word lists meaning that stop words like and or the are ignored during indexing as they provide little informative value for search thus enhancing search relevance and efficiency overall the law optimizes search queries and contributes to more precise search results"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "59", "default_text": "automatic indexing", "description": "how does automatic indexing improve the quality of search results", "narrative": "documents should demonstrate and analyze the effectiveness of automatic indexing in enhancing search results for users"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "61", "default_text": "zipf s law", "description": "find documents that deal with the correlation between the rank of a term and the probability of its occurence", "narrative": "relevant documents will illustrate the inversely proportional correlation between the rank of a term in a list sorted by term frequency and the probability of its occurence in said list"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "63", "default_text": "the role of user feedback in enhancing search engine relevance", "description": "how is user feedback used to improve the relevance of search engine results and what is its impact on search perfomance", "narrative": "relevant documents should discuss the methods of collecting and utilizing user feedback both implicit and explicit to refine search algorithms this includes examining techniques like click through data dwell time ratings and comments the focus should be on evaluating the effectiveness of these feedback mechanisms in improving search precision recall and overall user satisfaction additionally challenge such as data sparsity noise and privacy concerns should be adressed"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "65", "default_text": "multimedia in information retrieval", "description": "how do information retrieval systems handle multimedia content such as images videos and audio what are the key techniques and challenges", "narrative": "relevant documents should discuss approaches for indexing searching and retrieving multimedia content including content based retrieval and cross modal retrieval"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-koeln-20240614-in-progress-test", "qid": "67", "default_text": "social media information retrieval", "description": "what challenges arise in dealing with informal and unstructured data in the context of information retrieval on social media platforms", "narrative": "how do the challenges of dealing with informal and noisy data affect the effectiveness of information retrieval systems on social media platforms"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "1", "default_text": "event extraction using convolutional neural networks", "description": "how can convolutional neural networks help extracting events", "narrative": "relevant papers include research on event extraction systems or tools based on convolutional neural networks this excludes any research on machine learning approach other than cnns or research that does not focus on extracting events"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "2", "default_text": "similarity metrics for event extraction from social media", "description": "what similarity metrics can be used when extracting events from social media", "narrative": "relevant papers include research on similarity metrics that can be used when extracting events from social media this excludes any research that doesn t focus on similarity scores or does not focus on event extraction from social media"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "3", "default_text": "event extraction from cab traces", "description": "how can events get extracted based on the traces of cabs", "narrative": "relevant papers include research on event extraction from the traces of cabs taxis this excludes any research on event extraction that does not focus on event extraction from cab taxi traces like event extraction from social media"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "4", "default_text": "multimodal zero shot learning", "description": "which papers focus on multimodal zero shot learning methods", "narrative": "relevant papers include research on multimodal zero shot learning methods particularly those that involve multiple types of data such as images text audio or other modalities studies that propose new algorithms improve existing methods or apply multimodal zero shot learning are relevant papers that focus solely on single modal zero shot learning or multimodal methods without a zero shot learning component are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "5", "default_text": "self supervised image retrieval methods", "description": "which papers focus on self supervised image retrieval methods", "narrative": "relevant papers include research on self supervised image retrieval methods or how to improve those methods papers that focus on supervised unsupervised or semi supervised methods are not relevant as well as papers that do not focus on image retrieval tasks"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "6", "default_text": "multimodal large language models", "description": "which papers focus on multimodal large language models", "narrative": "relevant papers include research on multimodal large language models that integrate multiple types of data such as text images audio or video studies that propose new architectures techniques or applications of multimodal large language models are relevant papers that focus solely on unimodal large language models or multimodal models without a significant language component are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "7", "default_text": "multi hop question answering using retrieval augmented generation", "description": "wich papers focus on improving retrieval augmented generation for the purpose of multi hop question answering", "narrative": "relevant papers focus on research on retrieval augmented generation for the purpose of multi hop question answering or how to improve this methods papers that do focus on multi hop question answering using a different methode are not relevant papers that focus on retrieval augmented generation for a different purpose than multi hop question answering are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "8", "default_text": "sequence to sequence models for table question answering", "description": "wich papers focus on improving semantic parsing for question decomposition", "narrative": "relevant papers focus on research on semantic parsing for question decomposition or how to improve this methods papers that focus on other methods for question decomposition are not relevant as well as papers that do not focus on question decomposition"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "9", "default_text": "weakly supervised table semantic parsing", "description": "which papers focus on introducing new or improving existing weakly supervised semantic parsing methods for table question answering", "narrative": "relevant papers include research on weakly supervised semantic parsing methods for table question answering or how to improve those methods papers that focus on other methods for table question answering and papers that focus on question answering for something other than tables are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "10", "default_text": "relevance aware diversity metrics", "description": "which papers focus on introducing new or evaluating existing metrics for search result diversity that take the relevance of items into account", "narrative": "relevant papers include research on new or evaluations of existing relevance aware diversity metrics papers that focus on relevance oblivious diversity metrics and papers that do not focus on search result diversity metrics are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "11", "default_text": "coordination between small and large language models", "description": "which papers explore methods for coordinating small and large language models to improve reasoning capabilities", "narrative": "relevant papers include research on techniques for fine tuning small language models to enhance the performance of large language models particularly in complex reasoning tasks papers that do not focus on coordination between different sized models or reasoning capabilities are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "12", "default_text": "cross lingual information retrieval", "description": "which papers focus on improving cross lingual information retrieval systems", "narrative": "relevant papers include research on methods and technologies that enhance the retrieval of information across different languages including machine translation integration and multilingual embeddings papers that do not address cross lingual retrieval or related challenges are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-augsburg-20240525_0-test", "qid": "13", "default_text": "knowledge graph construction and utilization in nlp", "description": "which papers focus on the construction and utilization of knowledge graphs for enhancing natural language processing tasks", "narrative": "relevant papers include research on methods for constructing knowledge graphs from text techniques for improving the efficiency and robustness of knowledge graphs and their application in various nlp tasks such as information retrieval entity recognition and semantic search papers that do not address the construction or practical use of knowledge graphs in nlp are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "1", "default_text": "pagerank algorithm construction", "description": "what papers focus on the construction of the pagerank algorithm", "narrative": "relevant papers include research on how the pagerank algorithm is constructed and how the pagerank algorithm works papers that focus on the construction of another algorithm or on another aspects of the pagerank algorithm are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "2", "default_text": "tokenization multilingual challenge", "description": "what papers focus on the challenges of multilingual tokenization", "narrative": "relevant papers include research on the challenges of multilingual tokenization and how the challenges are dealt with papers that focus on the challenges of other kinds of tokenization or on other aspects of multilingual tokenization are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "3", "default_text": "enhancing semantic search accuracy", "description": "which papers focus on improving the accuracy of semantic search", "narrative": "relevant papers include research aimed at enhancing the accuracy of semantic search and investigating factors contributing to its improvement papers that focus on improving something else or improving the effectiveness of a search that is not a semantic search are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "4", "default_text": "crawling techniques overview", "description": "a top level overview of different crawling techniques and ideally their respective advantages and disadvangtages", "narrative": "relevant papers include comparisons between different crawling techniques and to a lesser extend presentations of a single crawling technique that also mentions its advantages and disadvantages"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "5", "default_text": "detecting query ambiguity", "description": "what papers focus on automatic detection of ambiguous queries and resolving the ambiguous meanings", "narrative": "relevant papers include research on detecting ambiguities in queries and resolving those ambiguities in different ways papers that focus on identifying some other part of the query or improving queries in general are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "6", "default_text": "log information for analysing metadata of search engine user behaviour", "description": "which papers focus on the use of log information for analysing metadata of search engine user behaviour", "narrative": "relevant papers will include research on the collection and analysis of log data from search engines with a focus on the types of metadata collected such as query terms click through rates session durations and other user interactions the goal is to understand how this data can be used to infer user intent personalize search results improve information retrieval effectiveness and address privacy concerns papers that focus on other aspects of user behaviour or do not use log information for analysis are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "7", "default_text": "decrease search time retrieval system", "description": "what papers focus on decreasing the search time of a retrieval system", "narrative": "relevant papers include research on what makes a retrieval system faster while ideally not decreasing the quality of results papers that focus on improving something else or decreasing the search time of a system that is not a retrieval system are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "8", "default_text": "impact of query expansion techniques on search performance", "description": "what studies investigate the impact of query expansion techniques on search performance", "narrative": "relevant studies explore the effects of various query expansion techniques on the performance of search systems papers focusing solely on query formulation or unrelated performance metrics are considered irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "9", "default_text": "retrieval system ranking", "description": "what papers focus on the ranking task of a retrieval system", "narrative": "relevant papers include research on how different ranking systems work in retrieval systems papers that focus on ranking systems of something else or ranking systems of a system that is not a retrieval system are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "10", "default_text": "most efficient retrieval models", "description": "what papers focus on discussing about the most efficient retrieval models", "narrative": "relevant papers discuss the advantages and disadvantages of the most important retrieval models focussing on efficiency they should compare different models considering different factors that lead to more efficiency papers that focus on just effectiveness or other most efficient models that are not retrieval models are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "11", "default_text": "personalized results in retrieval systems", "description": "what papers focus on the personalization of the results of an information retrieval system", "narrative": "relevant papers include research on what is important for personalizing the results of an information retrieval system maybe also evaluate the effectiveness of certain approaches and compare not relevant papers are such that don t concentrate on personalized results or on information retrieval systems"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "12", "default_text": "AI's impact on search engine effectiveness", "description": "does ai have a significant impact on the effectiveness of search engines and how does this impact the user", "narrative": "relevant papers explore the extent to which ai technologies impact the effectiveness of search engines this includes discussions on ai driven enhancements such as natural language processing semantic understanding and machine learning algorithms in search engine operations additionally relevant papers delve into the user experience improvements resulting from ai integration in search engines such as improved relevance precision and speed of search results papers not directly addressing ai s impact on search engine performance or user experience are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "13", "default_text": "information retrieval approaches", "description": "which papers focus on the ideas and concepts used for ir systems or introduce new approaches ideas", "narrative": "relevant papers include ones that focus on concepts used for modeling ir systems or on approaches used for implementing and evaluating an ir system as well as papers focused on introducing new approaches ideas for specific parts of an ir system e g evaluation only papers with a focus on ir are relevant introductory papers are not the focus"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "14", "default_text": "retrieval system speed", "description": "what papers focus on improving the speed of a retrieval system", "narrative": "relevant papers include research on what makes a retrieval system faster papers that focus on improving something else or improving the speed of a system that is not a retrieval system are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "15", "default_text": "retrieval systems indexing methods to optimize search precision", "description": "what papers discuss methods of indexing to enhance search precision in retrieval systems", "narrative": "relevant papers include research on indexing techniques specifically aimed at improving search precision and recalling in retrieval systems papers discussing indexing methods in other areas that aren t related to search precision enhancement in retrieval systems are not relevant papers that discuss search enhancing methods that aren t indexing aren t relevant as well as indexing methods that are used in systems that aren t retrieval systems"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "16", "default_text": "ranking functions", "description": "what papers mention ranking functions", "narrative": "relevant papers contain the types of ranking functions their advantages and disadvantages and their field of application papers that doesn t mentioned ranking function are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "17", "default_text": "AI-driven Web Crawling", "description": "research papers that explore the use of artificial intelligence in web crawling technologies", "narrative": "relevant studies should focus on how artificial intelligence can optimize the efficiency and accuracy of web crawling research that primarily discusses traditional web crawling technologies without integrating ai elements will be considered irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "18", "default_text": "Content Relevance Detection on Webpages", "description": "research papers that detail methods for determining the relevance of webpage content to specific topics or queries", "narrative": "relevant studies will explore specific algorithms or methodologies used to assess content relevance on webpages general content management or broad seo strategies that do not focus on relevance assessment will be deemed irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "19", "default_text": "Optimal Crawler for Genre Detection", "description": "research papers discussing the development and effectiveness of web crawlers designed for genre detection", "narrative": "relevant studies will focus on specialized web crawlers that are tailored to identify and categorize different genres on websites general web crawler technologies or those not specifically addressing genre detection will be considered irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "20", "default_text": "Formulating Optimal Searches for Specific Topics in Scientific Papers", "description": "research papers on developing optimal search queries for retrieving specific topics in scientific literature", "narrative": "relevant studies should discuss the creation and effectiveness of search queries tailored to specific scientific topics papers that broadly address search engine optimization without a clear focus on academic search queries will be deemed irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "21", "default_text": "Link Analysis in Information Retrieval", "description": "research papers that analyze the role of link analysis in improving the retrieval of information", "narrative": "relevant studies will focus on how link analysis can be leveraged to enhance the performance of information retrieval systems research not centered on link analysis or that broadly covers data mining techniques without a specific focus on links is deemed irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "22", "default_text": "query expansion techniques effectiveness", "description": "what papers focus on the effectiveness of different query expansion techniques in retrieval systems", "narrative": "relevant papers include various query expansion techniques and evaluate their impact on information retrieval performance papers focusing on other aspects of query processing or unrelated techniques are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "23", "default_text": "Influence of social media on political opinions and elections", "description": "which academic studies investigate how social media influence political attitudes and voting decisions particularly with a focus on the dissemination of information opinion forming election campaign strategies and the effect of disinformation in social networks", "narrative": "the search results should include both qualitative and quantitative research analysing the role of social media in modern political communication of interest are articles that examine the mechanisms of influencing opinion through social media their impact on voter behaviour and the strategies of political actors to use these platforms particularly relevant are studies that deal with recent elections and analyse the impact of targeted campaigns and fake news less relevant are general studies on media use that are not directly related to political processes"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "24", "default_text": "Use of stemming and lemmatisation in retrieval systems", "description": "which articles describe the possibilities and applications of the stemming and lemmatisation method in retrieval systems", "narrative": "relevant articles highlight the possible uses of stemming and or lemmatisation in retrieval systems or their future potential in this area irrelevant articles are those that refer to other methods or are based on the general explanation of lemmatisation and stemming or their differences"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "25", "default_text": "Reliability of information from user-generated content", "description": "which documents describe how reliable information from social media posts etc is", "narrative": "interesting are documents that deal with how to find or filter out informative good content and how to avoid giving too much weight to bad content is given too much weight less interesting is the description of user behaviour with search engines for example"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "26", "default_text": "Use and application of AI", "description": "which articles describe the use and different areas of application of modern ais", "narrative": "the search results should display high quality articles or scientific papers that describe the various areas of application of ais explain how they work and their future development less relevant articles are those that only refer to the latest trends and use simple buzzwords such as like ai or describe a more general ai system without real world use cases"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "27", "default_text": "retrieval models bm25 disadvantages", "description": "which papers discuss the disadvantages of the bm25 retrieval model", "narrative": "relevant papers include research on the disadvantages of the okapti bm25 retrieval model and how to improve the model papers that focus on other retrieval models or the advantages of bm25 are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "28", "default_text": "query-by-example retrieval of music", "description": "what papers focus on building a query by example retrieval system for music files", "narrative": "relevant papers include research on how to build a content based retrieval system which uses any kind of query by audio to retrieve relevant audio files papers which focus on text or video based queries or non audio retrieval systems are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "29", "default_text": "cross language information retrieval", "description": "what papers contain information on cross language information retrieval", "narrative": "relevant papers only include research specifically on clir or topics closely related to it"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "30", "default_text": "advancements in user interaction", "description": "what papers focus on improving the ways a user interacts with an information retrieval system", "narrative": "relevant papers include research on how to make user interfaces for retrieval systems easier to use or more effective in creating a useful query papers that focus on improving something else or improving the effectiveness of user interaces for a system that is not a retrieval system are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "31", "default_text": "retrieval system multiple languages challenges", "description": "what papers focus on the challenges for a retrieval system when dealing with multiple languages", "narrative": "relevant papers include research on the specific challenges faced by retrieval systems when dealing with content in multiple languages this includes but is not limited to issues related to language detection translation accuracy search query understanding across languages and cultural context considerations papers that focus solely on monolingual retrieval systems or that do not address the unique challenges of multilingual environments or that focus on other challenges entirely are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "32", "default_text": "discerning LLM-written texts from human-written texts", "description": "what methods and technologies can identify texts written by large language models as opposed to those written by humans", "narrative": "relevant papers focus on differentiating texts created by language models from those written by human authors this includes research on linguistic for example syntax or word choice or stylistic differences as well as algorithms or tools specifically designed for this purpose papers discussing general text analysis without focus on distinguishing between llm and human authors are not relevant neither are papers that generally describe quality of llm written texts not mentioning comparison methods"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "33", "default_text": "Neuroscience and brain-computer interfaces", "description": "how do neuroscience and brain computer interfaces revolutionize our understanding of the brain s complexities and enable direct communication between the mind and technology", "narrative": "relevant papers encompass studies exploring advancements in neuroscience and brain computer interfaces bcis highlighting techniques methodologies and algorithms driving innovation in these fields this includes research demonstrating how neuroscience sheds light on the intricacies of brain function and how bcis facilitate direct communication between the mind and technology discussions on the transformative impact of bcis on individuals with disabilities as well as their broader implications for human machine interaction are pertinent papers not directly addressing neuroscience or bcis or those lacking insights into their advancements and applications fall outside the scope of relevance"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "34", "default_text": "effectiveness supervised and unsupervised learning in NLP", "description": "what papers focus on the effectiveness of supervised and unsupervised learning in nlp", "narrative": "relevant papers include research on what the effectiveness of supervised and unsupervised learning in nlp are and how they affect the performance of the system papers that focus on something other than the effectiveness or performance of supervised and unsupervised learning in nlp are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "35", "default_text": "bm25 algorithm effectiveness", "description": "what papers explore bm25 and its effectiveness", "narrative": "relevant papers include information on the bm25 function and present results that show the effectiveness of bm25 they additionally explain why bm25 is more or less effective compared to other ranking methods"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "36", "default_text": "Image and Video Retrieval", "description": "research papers on techniques for retrieving relevant images and videos from large collections", "narrative": "relevant studies should explore methods such as content based image retrieval visual feature extraction and video summarization to improve the effectiveness of image and video retrieval systems research not addressing image or video retrieval or focusing solely on textual information is considered irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "37", "default_text": "Entity Recognition in Web Documents", "description": "research papers discussing techniques for identifying and extracting entities from web documents", "narrative": "relevant studies should detail methods for accurately recognizing entities such as people organizations and locations within web documents research not specifically focused on entity recognition or that covers generic text analysis without considering web documents is deemed irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "38", "default_text": "histroy of information retrieval", "description": "what papers focus on the history of retrieval system", "narrative": "relevant papers include research on retrieval systems and how they evolved over time papers that focus on improvements from the past to the future"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "39", "default_text": "query length influence on retrieval", "description": "what papers focus on the effect that query length has on information retrieval results", "narrative": "relevant papers include research on the correlation between query length and relevance of derived results papers that deal with any other influences on result relevance or any other research regarding lengths that are not query lengths are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "40", "default_text": "temporal document summarization in information retrieval systems", "description": "what papers focus on temporal document summarization in information retrieval systems", "narrative": "relevant papers adress algorithms and their characteristics like effectiveness and limits and their usage in the context of an information retrieval system papers that focus on document summarization for other system are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "41", "default_text": "how to evaluate a user interface of a retrieval system", "description": "what papers focus on evaluating the user interface of a retrieval system", "narrative": "relevant papers include research on how to evaluate user interfaces of retrieval systems and which measurement methods you could use for evaluating the user interface also the standard for a language is relevant any other papers that are connected to the user interface but not for the evaluation are irrelevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "42", "default_text": "Modifications in Deep Learning Architectures", "description": "papers in this topic explore alterations and enhancements made to machine learning architectures to improve performance across diverse tasks these modifications encompass adjustments to network structure activation functions regularization methods optimization algorithms and integration of domain specific knowledge", "narrative": "this topic covers research that investigates the modifications applied to machine learning architectures aiming to enhance their effectiveness and adaptability papers within this domain discuss the rationale behind these modifications evaluate their impact on model performance and provide insights into the broader implications for advancing machine learning techniques"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "43", "default_text": "knowledge graph construction", "description": "what papers focus on constructing knowledge graphs", "narrative": "relevant papers include research on algorithms and methodologies for automatically constructing knowledge graphs from unstructured or semi structured data sources papers that discuss other graph related tasks or focus on unrelated topics are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "44", "default_text": "fake news detection techniques", "description": "what papers explore techniques for detecting fake news", "narrative": "relevant papers include research on methods and approaches for identifying misinformation disinformation or fake news in textual or multimedia content papers that focus on unrelated tasks or on non fake news detection applications are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "45", "default_text": "recommendation systems using collaborative filtering", "description": "what papers focus on recommendation systems utilizing collaborative filtering", "narrative": "relevant papers include research on algorithms and approaches for generating personalized recommendations by leveraging user item interactions and collaborative filtering techniques papers that focus on other recommendation methods or unrelated topics are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "46", "default_text": "text summarization techniques", "description": "what papers explore techniques for text summarization", "narrative": "relevant papers include research on algorithms and methods for generating concise summaries of textual documents papers that discuss other natural language processing tasks or focus on unrelated topics are not relevant"}
{"dataset": "ir-lab-sose-2024/ir-acl-anthology-topics-leipzig-20240423-test", "qid": "47", "default_text": "Deep learning approaches for Information Retrieval", "description": "what research focuses on using deep learning methods for information retrieval", "narrative": "relevant papers include studies on the application of deep learning techniques such as neural networks convolutional neural networks recurrent neural networks and transformers for improving information retrieval tasks papers discussing traditional machine learning methods or unrelated topics are not relevant"}
